kj-akshay/buildEnvironment/tools/STM32CubeProgrammer/SVD/Cores/Cortex-M7.svd
<?xml version="1.0" encoding="utf-8"?>
<!--
Copyright (c) 2024 STMicroelectronics.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<device xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.3" xsi:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>ARM Ltd.</vendor>
  <vendorID>ARM</vendorID>
  <name>Cortex_M7</name>
  <version>1.3</version>
  <description>Cortex-M7 core descriptions, generated from ARM develloper studio</description>
  <cpu>
    <name>CM7</name>
    <revision>r0p0</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>8</nvicPrioBits>
    <vendorSystickConfig>true</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
    <peripheral>
      <name>Cache</name>
      <description>Cache Control</description>
      <baseAddress>0xE000ED78</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x204</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLIDR</name>
          <displayName>CLIDR</displayName>
          <description>CLIDR</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LoUU</name>
              <description>LoUU</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L1_cache</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L2_cache</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L3_cache</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LoC</name>
              <description>LoC</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L1_cache</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L2_cache</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L3_cache</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LoUIS</name>
              <description>LoUIS</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L1_cache</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L2_cache</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L3_cache</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CL7</name>
              <description>CL7</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>No_cache</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I_cache_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D_cache_only</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Separate_I_and_D_caches</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unified_cache</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CL6</name>
              <description>CL6</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>No_cache</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I_cache_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D_cache_only</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Separate_I_and_D_caches</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unified_cache</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CL5</name>
              <description>CL5</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>No_cache</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I_cache_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D_cache_only</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Separate_I_and_D_caches</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unified_cache</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CL4</name>
              <description>CL4</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>No_cache</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I_cache_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D_cache_only</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Separate_I_and_D_caches</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unified_cache</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CL3</name>
              <description>CL3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>No_cache</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I_cache_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D_cache_only</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Separate_I_and_D_caches</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unified_cache</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CL2</name>
              <description>CL2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>No_cache</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I_cache_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D_cache_only</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Separate_I_and_D_caches</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unified_cache</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CL1</name>
              <description>CL1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>No_cache</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I_cache_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D_cache_only</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Separate_I_and_D_caches</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Unified_cache</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTR</name>
          <displayName>CTR</displayName>
          <description>CTR</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>F</name>
              <description>F</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARMv6_and_earlier_format</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARMv7_format</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CWG</name>
              <description>CWG</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8_word_granularity</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_word_granularity</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERG</name>
              <description>ERG</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8_word_granularity</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_word_granularity</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMinLine</name>
              <description>DMinLine</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8_word_granularity</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_word_granularity</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L1IP</name>
              <description>L1IP</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Virtual_Index_Virtual_Tag</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Virtual_Index_Physical_Tag</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Physical_Index_Physical_Tag</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IminLine</name>
              <description>IminLine</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8_word_granularity</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_word_granularity</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCSIDR</name>
          <displayName>CCSIDR</displayName>
          <description>CCSIDR</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WT</name>
              <description>WT</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WB</name>
              <description>WB</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RA</name>
              <description>RA</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WA</name>
              <description>WA</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NS</name>
              <description>NS</description>
              <bitOffset>13</bitOffset>
              <bitWidth>15</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_16KB_cache_size</name>
                  <value>0x7F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32KB_cache_size</name>
                  <value>0xFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64KB_cache_size</name>
                  <value>0x1FF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>A</name>
              <description>A</description>
              <bitOffset>3</bitOffset>
              <bitWidth>10</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_1_way</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2_ways</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_3_ways</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4_ways</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_5_ways</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6_ways</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_7_ways</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8_ways</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_9_ways</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_10_ways</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_11_ways</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_12_ways</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_13_ways</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_14_ways</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_15_ways</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_ways</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LS</name>
              <description>Line Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_4_words</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8_words</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_words</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32_words</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64_words</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128_words</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256_words</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512_words</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSSELR</name>
          <displayName>CSSELR</displayName>
          <description>CSSELR</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>L</name>
              <description>Level</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>IND</name>
              <description>Type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Data_cache</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Instruction_cache</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ICIALLU</name>
          <displayName>ICIALLU</displayName>
          <description>ICIALLU</description>
          <addressOffset>0x1D8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>ICIMVAU</name>
          <displayName>ICIMVAU</displayName>
          <description>ICIMVAU</description>
          <addressOffset>0x1E0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>DCIMVAC</name>
          <displayName>DCIMVAC</displayName>
          <description>DCIMVAC</description>
          <addressOffset>0x1E4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>DCISW</name>
          <displayName>DCISW</displayName>
          <description>DCISW</description>
          <addressOffset>0x1E8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>DCCMVAU</name>
          <displayName>DCCMVAU</displayName>
          <description>DCCMVAU</description>
          <addressOffset>0x1EC</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>DCCMVAC</name>
          <displayName>DCCMVAC</displayName>
          <description>DCCMVAC</description>
          <addressOffset>0x1F0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>DCCSW</name>
          <displayName>DCCSW</displayName>
          <description>DCCSW</description>
          <addressOffset>0x1F4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>DCCIMVAC</name>
          <displayName>DCCIMVAC</displayName>
          <description>DCCIMVAC</description>
          <addressOffset>0x1F8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
