kj-akshay/buildEnvironment/tools/STM32CubeProgrammer/SVD/Cores/Cortex-M7.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ImpDef</name>
      <description>Implementation defined registers</description>
      <baseAddress>0xE000EF90</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ITCMCR</name>
          <displayName>ITCMCR</displayName>
          <description>ITCMCR</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SZ</name>
              <description>SZ</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>No_TCM</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4KB</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8KB</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16KB</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32KB</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64KB</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256KB</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512KB</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1MB</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2MB</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4MB</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8MB</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16MB</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RETEN</name>
              <description>RETEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RMW</name>
              <description>RMW</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DTCMCR</name>
          <displayName>DTCMCR</displayName>
          <description>DTCMCR</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TCM_Size</name>
              <description>TCM_Size</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>No_TCM</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4KB</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8KB</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16KB</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32KB</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64KB</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256KB</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512KB</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1MB</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2MB</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4MB</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8MB</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16MB</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RETEN</name>
              <description>RETEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RMW</name>
              <description>RMW</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBPCR</name>
          <displayName>AHBPCR</displayName>
          <description>AHBPCR</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SZ</name>
              <description>SZ</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_64MB</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128MB</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256MB</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512MB</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CACR</name>
          <displayName>CACR</displayName>
          <description>CACR</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WT</name>
              <description>WT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECC</name>
              <description>ECC</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIWT</name>
              <description>SIWT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBSCR</name>
          <displayName>AHBSCR</displayName>
          <description>AHBSCR</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INITCOUNT</name>
              <description>INITCOUNT</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TPRI</name>
              <description>TPRI</description>
              <bitOffset>2</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>CTL</name>
              <description>CTL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ABFSR</name>
          <displayName>ABFSR</displayName>
          <description>ABFSR</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EPPB</name>
              <description>EPPB</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXIM</name>
              <description>AXIM</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHBP</name>
              <description>AHBP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTCM</name>
              <description>DTCM</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ITCM</name>
              <description>ITCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
